improve chart visuals
